lecture02/simulations/00TJunctionGas/0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 303.15;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           uniform 303.15;
    }

    outlet1
    {
        type            zeroGradient;        
    }
    
    outlet2
    {
        type            zeroGradient;        
    }    

    walls
    {
        type            zeroGradient;
    }    
    
    frontAndBack
    {
        type            empty;
    }

}


// ************************************************************************* //
